In [119]:
import pandas as pd

In [120]:
# Set file path
file = ("Resources/purchase_data.csv")
df = pd.read_csv(file, encoding="latin1")

In [121]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [122]:
# PLAYER COUNT

# Total Number of unique players
user_count = len(df.groupby(["SN"]))
pd.DataFrame({'Total Players': [user_count]})

   Total Players
0            576

In [125]:
# PURCHASING ANALYSIS

# Number of unique items
unique_items =  len(df.groupby(["Item Name"]))

# average purchase price
avg_purchases = df["Price"].mean()
currency_string = "${:,.2f}".format(avg_purchases)

# Total purchases
purchase_count = df["Purchase ID"].count()


# Total Revenue
total_purchases = df["Price"].sum()
total_purchases_curr = "${:,.2f}".format(total_purchases)




df_pa = pd.DataFrame({
    'Number of Unique Items': [unique_items],
    'Average price': [currency_string],
    'Number of Purchases': [purchase_count],
    'Total Revenue': [total_purchases_curr]
})

df_pa

   Number of Unique Items Average price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [130]:
df_gender = df.groupby(["SN"])
df_gender.count()

               Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76             1    1       1        1          1      1
Adastirin33              1    1       1        1          1      1
Aeda94                   1    1       1        1          1      1
Aela59                   1    1       1        1          1      1
Aelaria33                1    1       1        1          1      1
...                    ...  ...     ...      ...        ...    ...
Yathecal82               3    3       3        3          3      3
Yathedeu43               2    2       2        2          2      2
Yoishirrala98            1    1       1        1          1      1
Zhisrisu83               2    2       2        2          2      2
Zontibe81                3    3       3        3          3      3

[576 rows x 6 columns]

In [51]:
# GENDER DEMOGRAPHICS

# Percentage and Count of Male Players 484
male_df = df.loc[df["Gender"]=="Male",:]
male_count = len(male_df.groupby(["SN"]))
male_pct = male_count/user_count
male_pct
# Percentage and Count of Female Players
female_df = df.loc[df["Gender"]=="Female",:]
female_count = len(female_df.groupby(["SN"]))
female_pct = female_count/user_count
female_pct

# Percentage and Count of Other / Non-Disclosed
other_df = df.loc[df["Gender"]=="Other / Non-Disclosed",:]
other_count = len(other_df.groupby(["SN"]))
other_pct = other_count/user_count
other_pct


gender_demo = [{"Total Count": "New Jersey", "Percentage of Players": "NJ"},
                {"Total Count": "New York", "Percentage of Players": "NY"}]


print(male_count, male_pct, female_count, female_pct, other_count, other_pct)

484 0.8402777777777778 81 0.140625 11 0.019097222222222224

3.050987179487176